cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51N.svd
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset Synchronization Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable Synchronization Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WINCTRL</name>
              <description>WINCTRL Synchronization Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPCTRL0</name>
              <description>COMPCTRL 0 Synchronization Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPCTRL1</name>
              <description>COMPCTRL 1 Synchronization Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIB</name>
          <description>Calibration</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <resetValue>0x0101</resetValue>
          <fields>
            <field>
              <name>BIAS0</name>
              <description>COMP0/1 Bias Scaling</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC0</name>
      <version>1.0.0</version>
      <description>Analog Digital Converter 0</description>
      <groupName>ADC</groupName>
      <prependToName>ADC_</prependToName>
      <baseAddress>0x43001C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC0_OTHER</name>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>ADC0_RESRDY</name>
        <value>119</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DUALSEL</name>
              <description>Dual Mode Trigger Selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DUALSELSelect</name>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Start event or software trigger will start a conversion on both ADCs</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERLEAVE</name>
                  <description>START event or software trigger will alternatingly start a conversion on ADC0 and ADC1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLAVEEN</name>
              <description>Slave Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRESCALER</name>
              <description>Prescaler Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PRESCALERSelect</name>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Peripheral clock divided by 2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Peripheral clock divided by 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Peripheral clock divided by 8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Peripheral clock divided by 16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Peripheral clock divided by 32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Peripheral clock divided by 64</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Peripheral clock divided by 128</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>Peripheral clock divided by 256</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>R2R</name>
              <description>Rail to Rail Operation Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLUSHEI</name>
              <description>Flush Event Input Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STARTEI</name>
              <description>Start Conversion Event Input Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLUSHINV</name>
              <description>Flush Event Invert Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STARTINV</name>
              <description>Start Conversion Event Invert Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESRDYEO</name>
              <description>Result Ready Event Out</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMONEO</name>
              <description>Window Monitor Event Out</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x03</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INPUTCTRL</name>
          <description>Input Control</description>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>MUXPOS</name>
              <description>Positive Mux Input Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>MUXPOSSelect</name>
                <enumeratedValue>
                  <name>AIN0</name>
                  <description>ADC AIN0 Pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN1</name>
                  <description>ADC AIN1 Pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN2</name>
                  <description>ADC AIN2 Pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN3</name>
                  <description>ADC AIN3 Pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC AIN4 Pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC AIN5 Pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC AIN6 Pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC AIN7 Pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN8</name>
                  <description>ADC AIN8 Pin</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN9</name>
                  <description>ADC AIN9 Pin</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN10</name>
                  <description>ADC AIN10 Pin</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN11</name>
                  <description>ADC AIN11 Pin</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN12</name>
                  <description>ADC AIN12 Pin</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN13</name>
                  <description>ADC AIN13 Pin</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN14</name>
                  <description>ADC AIN14 Pin</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN15</name>
                  <description>ADC AIN15 Pin</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN16</name>
                  <description>ADC AIN16 Pin</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN17</name>
                  <description>ADC AIN17 Pin</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN18</name>
                  <description>ADC AIN18 Pin</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN19</name>
                  <description>ADC AIN19 Pin</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN20</name>
                  <description>ADC AIN20 Pin</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN21</name>
                  <description>ADC AIN21 Pin</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN22</name>
                  <description>ADC AIN22 Pin</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN23</name>
                  <description>ADC AIN23 Pin</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALEDCOREVCC</name>
                  <description>1/4 Scaled Core Supply</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALEDVBAT</name>
                  <description>1/4 Scaled VBAT Supply</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALEDIOVCC</name>
                  <description>1/4 Scaled I/O Supply</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANDGAP</name>
                  <description>Bandgap Voltage</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTAT</name>
                  <description>Temperature Sensor</description>
                  <value>0x1c</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTAT</name>
                  <description>Temperature Sensor</description>
                  <value>0x1d</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>DAC Output</description>
                  <value>0x1e</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC</name>
                  <description>PTC output (only on ADC0)</description>
                  <value>0x1f</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIFFMODE</name>
              <description>Differential Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MUXNEG</name>
              <description>Negative Mux Input Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <name>MUXNEGSelect</name>
                <enumeratedValue>
                  <name>AIN0</name>
                  <description>ADC AIN0 Pin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN1</name>
                  <description>ADC AIN1 Pin</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN2</name>
                  <description>ADC AIN2 Pin</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN3</name>
                  <description>ADC AIN3 Pin</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN4</name>
                  <description>ADC AIN4 Pin</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN5</name>
                  <description>ADC AIN5 Pin</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN6</name>
                  <description>ADC AIN6 Pin</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIN7</name>
                  <description>ADC AIN7 Pin</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Internal Ground</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSEQSTOP</name>
              <description>Stop DMA Sequencing</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x06</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>LEFTADJ</name>
              <description>Left-Adjusted Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREERUN</name>
              <description>Free Running Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CORREN</name>
              <description>Digital Correction Logic Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESSEL</name>
              <description>Conversion Result Resolution</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RESSELSelect</name>
                <enumeratedValue>
                  <name>12BIT</name>
                  <description>12-bit result</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BIT</name>
                  <description>For averaging mode output</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10BIT</name>
                  <description>10-bit result</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BIT</name>
                  <description>8-bit result</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Window Monitor Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>WINMODESelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No window mode (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>RESULT &gt; WINLT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>RESULT &lt; WINUT</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>WINLT &lt; RESULT &lt; WINUT</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE4</name>
                  <description>!(WINLT &lt; RESULT &lt; WINUT)</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINSS</name>
              <description>Window Single Sample</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
