cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51N.svd
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>READY</name>
              <description>Ready to accept a command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRM</name>
              <description>Power Reduction Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOAD</name>
              <description>NVM Page Buffer Active Loading</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUSP</name>
              <description>NVM Write Or Erase Operation Is Suspended</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AFIRST</name>
              <description>BANKA First</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BPDIS</name>
              <description>Boot Loader Protection Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOTPROT</name>
              <description>Boot Loader Protection Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <description>Address</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>NVM Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RUNLOCK</name>
          <description>Lock Section</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RUNLOCK</name>
              <description>Region Un-Lock Bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PBLDATA%s</name>
          <description>Page Buffer Load Data x</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Page Buffer Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCERR</name>
          <description>ECC Error Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TYPEL</name>
              <description>Low Double-Word Error Type</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>TYPELSelect</name>
                <enumeratedValue>
                  <name>None</name>
                  <description>No Error Detected Since Last Read</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Single</name>
                  <description>At Least One Single Error Detected Since last Read</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Dual</name>
                  <description>At Least One Dual Error Detected Since Last Read</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TYPEH</name>
              <description>High Double-Word Error Type</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>TYPEHSelect</name>
                <enumeratedValue>
                  <name>None</name>
                  <description>No Error Detected Since Last Read</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Single</name>
                  <description>At Least One Single Error Detected Since last Read</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Dual</name>
                  <description>At Least One Dual Error Detected Since Last Read</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x28</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ECCDIS</name>
              <description>Debugger ECC Read Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCELOG</name>
              <description>Debugger ECC Error Tracking Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEECFG</name>
          <description>SmartEEPROM Configuration Register</description>
          <addressOffset>0x2A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>WMODE</name>
              <description>Write Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WMODESelect</name>
                <enumeratedValue>
                  <name>UNBUFFERED</name>
                  <description>A NVM write command is issued after each write in the pagebuffer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFFERED</name>
                  <description>A NVM write command is issued when a write to a new page is requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APRDIS</name>
              <description>Automatic Page Reallocation Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEESTAT</name>
          <description>SmartEEPROM Status Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ASEES</name>
              <description>Active SmartEEPROM Sector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOAD</name>
              <description>Page Buffer Loaded</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <description>SmartEEPROM Write Access Is Locked</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RLOCK</name>
              <description>SmartEEPROM Write Access To Register Address Space Is Locked</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBLK</name>
              <description>Blocks Number In a Sector</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSZ</name>
              <description>SmartEEPROM Page Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
