cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51N.svd
        <register>
          <name>DFLLCTRLB</name>
          <description>DFLL48M Control B</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Operating Mode Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STABLE</name>
              <description>Stable DFLL Frequency</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LLAW</name>
              <description>Lose Lock After Wake</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBCRM</name>
              <description>USB Clock Recovery Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCDIS</name>
              <description>Chill Cycle Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QLDIS</name>
              <description>Quick Lock Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BPLCKC</name>
              <description>Bypass Coarse Lock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAITLOCK</name>
              <description>Wait Lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLVAL</name>
          <description>DFLL48M Value</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>FINE</name>
              <description>Fine Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>COARSE</name>
              <description>Coarse Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>DIFF</name>
              <description>Multiplication Ratio Difference</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLMUL</name>
          <description>DFLL48M Multiplier</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MUL</name>
              <description>DFLL Multiply Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>FSTEP</name>
              <description>Fine Maximum Step</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CSTEP</name>
              <description>Coarse Maximum Step</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLLSYNC</name>
          <description>DFLL48M Synchronization</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>ENABLE Synchronization Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFLLCTRLB</name>
              <description>DFLLCTRLB Synchronization Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFLLVAL</name>
              <description>DFLLVAL Synchronization Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFLLMUL</name>
              <description>DFLLMUL Synchronization Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x14</dimIncrement>
          <name>DPLLCTRLA%s</name>
          <description>DPLL Control A</description>
          <addressOffset>0x30</addressOffset>
          <size>8</size>
          <resetValue>0x80</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DPLL Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONDEMAND</name>
              <description>On Demand Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x14</dimIncrement>
          <name>DPLLRATIO%s</name>
          <description>DPLL Ratio Control</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LDR</name>
              <description>Loop Divider Ratio</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
            <field>
              <name>LDRFRAC</name>
              <description>Loop Divider Ratio Fractional Part</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x14</dimIncrement>
          <name>DPLLCTRLB%s</name>
          <description>DPLL Control B</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>FILTER</name>
              <description>Proportional Integral Filter Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>WUF</name>
              <description>Wake Up Fast</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REFCLK</name>
              <description>Reference Clock Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>REFCLKSelect</name>
                <enumeratedValue>
                  <name>GCLK</name>
                  <description>Dedicated GCLK clock reference</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC32</name>
                  <description>XOSC32K clock reference</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC0</name>
                  <description>XOSC0 clock reference</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC1</name>
                  <description>XOSC1 clock reference</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LTIME</name>
              <description>Lock Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>LTIMESelect</name>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>No time-out. Automatic lock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>800US</name>
                  <description>Time-out if no lock within 800us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>900US</name>
                  <description>Time-out if no lock within 900us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MS</name>
                  <description>Time-out if no lock within 1ms</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P1MS</name>
                  <description>Time-out if no lock within 1.1ms</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LBYPASS</name>
              <description>Lock Bypass</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCOFILTER</name>
              <description>Sigma-Delta DCO Filter Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DCOEN</name>
              <description>DCO Filter Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIV</name>
              <description>Clock Divider</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x14</dimIncrement>
          <name>DPLLSYNCBUSY%s</name>
          <description>DPLL Synchronization Busy</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>DPLL Enable Synchronization Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPLLRATIO</name>
              <description>DPLL Loop Divider Ratio Synchronization Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x14</dimIncrement>
          <name>DPLLSTATUS%s</name>
          <description>DPLL Status</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>LOCK</name>
              <description>DPLL Lock Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKRDY</name>
              <description>DPLL Clock Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
