cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51N.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RAMECC</name>
      <version>1.0.0</version>
      <description>RAM ECC</description>
      <groupName>RAMECC</groupName>
      <prependToName>RAMECC_</prependToName>
      <baseAddress>0x41020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RAMECC</name>
        <value>45</value>
      </interrupt>
      <registers>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SINGLEE</name>
              <description>Single Bit ECC Error Interrupt Enable Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DUALE</name>
              <description>Dual Bit ECC Error Interrupt Enable Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SINGLEE</name>
              <description>Single Bit ECC Error Interrupt Enable Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DUALE</name>
              <description>Dual Bit ECC Error Interrupt Enable Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SINGLEE</name>
              <description>Single Bit ECC Error Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DUALE</name>
              <description>Dual Bit ECC Error Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ECCDIS</name>
              <description>ECC Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERRADDR</name>
          <description>Error Address</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ERRADDR</name>
              <description>Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0xF</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ECCDIS</name>
              <description>ECC Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCELOG</name>
              <description>ECC Error Log</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RSTC</name>
      <version>4.0.0</version>
      <description>Reset Controller</description>
      <groupName>RSTC</groupName>
      <prependToName>RSTC_</prependToName>
      <baseAddress>0x40000C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RCAUSE</name>
          <description>Reset Cause</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>POR</name>
              <description>Power On Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BODCORE</name>
              <description>Brown Out CORE Detector Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BODVDD</name>
              <description>Brown Out VDD Detector Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVM</name>
              <description>NVM Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXT</name>
              <description>External Reset</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT</name>
              <description>Watchdog Reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYST</name>
              <description>System Reset Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BACKUP</name>
              <description>Backup Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BKUPEXIT</name>
          <description>Backup Exit Source</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RTC</name>
              <description>Real Timer Counter Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BBPS</name>
              <description>Battery Backup Power Switch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HIB</name>
              <description>Hibernate</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
