cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51N.svd
        <register>
          <name>HC2R</name>
          <description>Host Control 2</description>
          <addressOffset>0x03E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>UHSMS</name>
              <description>UHS Mode Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>UHSMSSelect</name>
                <enumeratedValue>
                  <name>SDR12</name>
                  <description>SDR12</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR25</name>
                  <description>SDR25</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR50</name>
                  <description>SDR50</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR104</name>
                  <description>SDR104</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR50</name>
                  <description>DDR50</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VS18EN</name>
              <description>1.8V Signaling Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VS18ENSelect</name>
                <enumeratedValue>
                  <name>S33V</name>
                  <description>3.3V Signaling</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S18V</name>
                  <description>1.8V Signaling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSEL</name>
              <description>Driver Strength Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DRVSELSelect</name>
                <enumeratedValue>
                  <name>B</name>
                  <description>Driver Type B is Selected (Default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>Driver Type A is Selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Driver Type C is Selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Driver Type D is Selected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTUN</name>
              <description>Execute Tuning</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EXTUNSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Not Tuned or Tuning Completed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUESTED</name>
                  <description>Execute Tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLCKSEL</name>
              <description>Sampling Clock Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SLCKSELSelect</name>
                <enumeratedValue>
                  <name>FIXED</name>
                  <description>Fixed clock is used to sample data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TUNED</name>
                  <description>Tuned clock is used to sample data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASINTEN</name>
              <description>Asynchronous Interrupt Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ASINTENSelect</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVALEN</name>
              <description>Preset Value Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PVALENSelect</name>
                <enumeratedValue>
                  <name>HOST</name>
                  <description>SDCLK and Driver Strength are controlled by Host Controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic Selection by Preset Value is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HC2R_EMMC</name>
          <description>Host Control 2</description>
          <alternateRegister>HC2R</alternateRegister>
          <addressOffset>0x03E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HS200EN</name>
              <description>HS200 Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>HS200ENSelect</name>
                <enumeratedValue>
                  <name>SDR12</name>
                  <description>SDR12</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR25</name>
                  <description>SDR25</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR50</name>
                  <description>SDR50</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDR104</name>
                  <description>SDR104</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR50</name>
                  <description>DDR50</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVSEL</name>
              <description>Driver Strength Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DRVSELSelect</name>
                <enumeratedValue>
                  <name>B</name>
                  <description>Driver Type B is Selected (Default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>Driver Type A is Selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Driver Type C is Selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D</name>
                  <description>Driver Type D is Selected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTUN</name>
              <description>Execute Tuning</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EXTUNSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Not Tuned or Tuning Completed</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUESTED</name>
                  <description>Execute Tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLCKSEL</name>
              <description>Sampling Clock Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SLCKSELSelect</name>
                <enumeratedValue>
                  <name>FIXED</name>
                  <description>Fixed clock is used to sample data</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TUNED</name>
                  <description>Tuned clock is used to sample data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVALEN</name>
              <description>Preset Value Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PVALENSelect</name>
                <enumeratedValue>
                  <name>HOST</name>
                  <description>SDCLK and Driver Strength are controlled by Host Controller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic Selection by Preset Value is Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CA0R</name>
          <description>Capabilities 0</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x27E80080</resetValue>
          <fields>
            <field>
              <name>TEOCLKF</name>
              <description>Timeout Clock Frequency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <enumeratedValues>
                <name>TEOCLKFSelect</name>
                <enumeratedValue>
                  <name>OTHER</name>
                  <description>Get information via another method</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEOCLKU</name>
              <description>Timeout Clock Unit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TEOCLKUSelect</name>
                <enumeratedValue>
                  <name>KHZ</name>
                  <description>kHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MHZ</name>
                  <description>MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASECLKF</name>
              <description>Base Clock Frequency</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>BASECLKFSelect</name>
                <enumeratedValue>
                  <name>OTHER</name>
                  <description>Get information via another method</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXBLKL</name>
              <description>Max Block Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MAXBLKLSelect</name>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048</name>
                  <description>2048 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ED8SUP</name>
              <description>8-bit Support for Embedded Device</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ED8SUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>8-bit Bus Width not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>8-bit Bus Width Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMA2SUP</name>
              <description>ADMA2 Support</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ADMA2SUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>ADMA2 not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>ADMA2 Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSSUP</name>
              <description>High Speed Support</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>HSSUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>High Speed not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>High Speed Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMASUP</name>
              <description>SDMA Support</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SDMASUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>SDMA not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>SDMA Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRSUP</name>
              <description>Suspend/Resume Support</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SRSUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Suspend/Resume not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Suspend/Resume Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V33VSUP</name>
              <description>Voltage Support 3.3V</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>V33VSUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>3.3V Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>3.3V Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V30VSUP</name>
              <description>Voltage Support 3.0V</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>V30VSUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>3.0V Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>3.0V Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V18VSUP</name>
              <description>Voltage Support 1.8V</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>V18VSUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>1.8V Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>1.8V Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SB64SUP</name>
              <description>64-Bit System Bus Support</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SB64SUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>32-bit Address Descriptors and System Bus</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>64-bit Address Descriptors and System Bus</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASINTSUP</name>
              <description>Asynchronous Interrupt Support</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ASINTSUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Asynchronous Interrupt not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Asynchronous Interrupt supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLTYPE</name>
              <description>Slot Type</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SLTYPESelect</name>
                <enumeratedValue>
                  <name>REMOVABLE</name>
                  <description>Removable Card Slot</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMBEDDED</name>
                  <description>Embedded Slot for One Device</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
