cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51N.svd
    <peripheral derivedFrom="SERCOM0">
      <name>SERCOM4</name>
      <description>Serial Communication Interface 4</description>
      <baseAddress>0x43000000</baseAddress>
      <interrupt>
        <name>SERCOM4_0</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>SERCOM4_1</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>SERCOM4_2</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>SERCOM4_OTHER</name>
        <value>65</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SERCOM0">
      <name>SERCOM5</name>
      <description>Serial Communication Interface 5</description>
      <baseAddress>0x43000400</baseAddress>
      <interrupt>
        <name>SERCOM5_0</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>SERCOM5_1</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>SERCOM5_2</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>SERCOM5_OTHER</name>
        <value>69</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SERCOM0">
      <name>SERCOM6</name>
      <description>Serial Communication Interface 6</description>
      <baseAddress>0x43000800</baseAddress>
      <interrupt>
        <name>SERCOM6_0</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>SERCOM6_1</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>SERCOM6_2</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>SERCOM6_OTHER</name>
        <value>73</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SERCOM0">
      <name>SERCOM7</name>
      <description>Serial Communication Interface 7</description>
      <baseAddress>0x43000C00</baseAddress>
      <interrupt>
        <name>SERCOM7_0</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>SERCOM7_1</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>SERCOM7_2</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>SERCOM7_OTHER</name>
        <value>77</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SUPC</name>
      <version>1.1.0</version>
      <description>Supply Controller</description>
      <groupName>SUPC</groupName>
      <prependToName>SUPC_</prependToName>
      <baseAddress>0x40001800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SUPC_OTHER</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>SUPC_BODDET</name>
        <value>9</value>
      </interrupt>
      <registers>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOD33RDY</name>
              <description>BOD33 Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B33SRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD12RDY</name>
              <description>BOD12 Ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD12DET</name>
              <description>BOD12 Detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B12SRDY</name>
              <description>BOD12 Synchronization Ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREGRDY</name>
              <description>Voltage Regulator Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VCORERDY</name>
              <description>VDDCORE Ready</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOD33RDY</name>
              <description>BOD33 Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B33SRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD12RDY</name>
              <description>BOD12 Ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD12DET</name>
              <description>BOD12 Detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B12SRDY</name>
              <description>BOD12 Synchronization Ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREGRDY</name>
              <description>Voltage Regulator Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VCORERDY</name>
              <description>VDDCORE Ready</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BOD33RDY</name>
              <description>BOD33 Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B33SRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD12RDY</name>
              <description>BOD12 Ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOD12DET</name>
              <description>BOD12 Detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>B12SRDY</name>
              <description>BOD12 Synchronization Ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREGRDY</name>
              <description>Voltage Regulator Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VCORERDY</name>
              <description>VDDCORE Ready</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Power and Clocks Status</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BOD33RDY</name>
              <description>BOD33 Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>B33SRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD12RDY</name>
              <description>BOD12 Ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BOD12DET</name>
              <description>BOD12 Detection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>B12SRDY</name>
              <description>BOD12 Synchronization Ready</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREGRDY</name>
              <description>Voltage Regulator Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VCORERDY</name>
              <description>VDDCORE Ready</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD33</name>
          <description>BOD33 Control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTION</name>
              <description>Action when Threshold Crossed</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACTIONSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>The BOD33 generates a reset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>The BOD33 generates an interrupt</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BKUP</name>
                  <description>The BOD33 puts the device in backup sleep mode</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STDBYCFG</name>
              <description>Configuration in Standby mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNHIB</name>
              <description>Run in Hibernate mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNBKUP</name>
              <description>Run in Backup mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYST</name>
              <description>Hysteresis value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PSEL</name>
              <description>Prescaler Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>PSELSelect</name>
                <enumeratedValue>
                  <name>NODIV</name>
                  <description>Not divided</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide clock by 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide clock by 8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide clock by 16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide clock by 32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide clock by 64</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Divide clock by 128</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>Divide clock by 256</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEVEL</name>
              <description>Threshold Level for VDD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>VBATLEVEL</name>
              <description>Threshold Level in battery backup sleep mode for VBAT</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD12</name>
          <description>BOD12 Control</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYST</name>
              <description>Hysteresis Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTION</name>
              <description>Action when Threshold Crossed</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACTIONSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>The BOD12 generates a reset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>The BOD12 generates an interrupt</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STDBYCFG</name>
              <description>Configuration in Standby mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run during Standby</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTCFG</name>
              <description>Configuration in Active mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSEL</name>
              <description>Prescaler Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>PSELSelect</name>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide clock by 2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide clock by 4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide clock by 8</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide clock by 16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide clock by 32</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide clock by 64</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Divide clock by 128</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>Divide clock by 256</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV512</name>
                  <description>Divide clock by 512</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV1024</name>
                  <description>Divide clock by 1024</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2048</name>
                  <description>Divide clock by 2048</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4096</name>
                  <description>Divide clock by 4096</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8192</name>
                  <description>Divide clock by 8192</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16384</name>
                  <description>Divide clock by 16384</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32768</name>
                  <description>Divide clock by 32768</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV65536</name>
                  <description>Divide clock by 65536</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEVEL</name>
              <description>Threshold Level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
